tap "nao1215/tap"
brew "python@3.13"
brew "ansible"
brew "atmos"
brew "bat"
brew "bat-extras"
brew "clusterctl"
brew "cpio"
brew "ctlptl"
brew "docker"
brew "dyff"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "grpcurl"
brew "helm"
brew "htop"
brew "ipcalc"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubecolor"
brew "kubeconform"
brew "kubectx"
brew "kubetail"
brew "kubie"
brew "lima"
brew "pluto"
brew "pre-commit"
brew "qemu"
brew "ripgrep"
brew "s3cmd"
brew "stern"
brew "tmux"
brew "viddy"
brew "vim"
brew "virtualenv"
brew "watch"
brew "yadm"
brew "yamlfmt"
brew "yamllint"
brew "yq"
brew "zsh"
brew "nao1215/tap/gup"
cask "firefox"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "davidanson.vscode-markdownlint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-commander"
vscode "ms-vscode.vscode-copilot-vision"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicollasr.vscode-streamdeck"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tilt-dev.tiltfile"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
